app/controllers/bench_marks_controller.rb

SELECT "bench_marks".* FROM "bench_marks" WHERE "bench_marks"."sub_project_id" = 1 ORDER BY title asc
---
  def index
    @bench_marks = @sub_project.bench_marks.order('title asc')