app/controllers/coordinates_controller.rb

  def index
    @coordinates = @sub_project.coordinates.order('created_at asc')
---
SELECT "coordinates".* FROM "coordinates" WHERE "coordinates"."sub_project_id" = 1 ORDER BY created_at asc