app/controllers/projects_controller.rb

SELECT "sub_projects".* FROM "sub_projects" WHERE "sub_projects"."project_id" = 1
---
  def index
    @projects = Project.all