app/controllers/site_maps_controller.rb

SELECT "site_maps".* FROM "site_maps" WHERE "site_maps"."sub_project_id" = 1 ORDER BY created_at asc
---
  def index
    if params[:group_type].present?
      @site_maps = @sub_project.site_maps.where(:group_type => params[:group_type]).order('created_at asc')
    else
      @site_maps = @sub_project.site_maps.order('created_at asc')

SELECT "site_maps".* FROM "site_maps" WHERE "site_maps"."sub_project_id" = 1
---
    def set_site_map
      @site_map = @sub_project.site_maps.find(params[:id])