app/controllers/structure_drawings_controller.rb

    def set_parents
      @project = Project.find(params[:project_id])
      @sub_project = @project.sub_projects.find(params[:sub_project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "sub_projects".* FROM "sub_projects" WHERE "sub_projects"."project_id" = 1 AND "sub_projects"."id" = 1 LIMIT 1