app/controllers/sub_projects_controller.rb

SELECT "sub_projects".* FROM "sub_projects" WHERE "sub_projects"."project_id" = 4 AND "sub_projects"."id" = 8 LIMIT 1
---
    def set_sub_project
      @sub_project = @project.sub_projects.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 4 LIMIT 1
---
    def set_project
      @project = Project.find(params[:project_id])