app/controllers/village_maps_controller.rb

SELECT "site_maps".* FROM "site_maps" WHERE "site_maps"."sub_project_id" = 1
---
    def set_village_map
      @village_map = @sub_project.village_maps.find(params[:id])