app/views/layouts/application.html.erb

SELECT "site_maps".* FROM "site_maps" WHERE "site_maps"."sub_project_id" = 1
---

                  <% if @sub_project.site_maps.group_by(&:group_type).keys.count <= 1 %>

SELECT "site_maps".* FROM "site_maps" WHERE "site_maps"."sub_project_id" = 1
---
                      <ul class="dropdown-menu">
                      <% @sub_project.site_maps.group_by(&:group_type).keys.each_with_index  do |mname, index| %>

SELECT "custom_menus".* FROM "custom_menus" WHERE "custom_menus"."sub_project_id" = 1
---

                  <% @sub_project.custom_menus.all.group_by(&:menu_name).each_pair do |menu_name, menu|%>

SELECT "projects".* FROM "projects"
---
                  </div>
                  <% Project.all.each do |project|%>

SELECT "sub_projects".* FROM "sub_projects" WHERE "sub_projects"."project_id" = 1
---
                        </li>
                        <% project.sub_projects.each do |sub_project|%>